Repository: zz0-0/loom
Catalog: loom/lib/l10n/app_*.arb
Languages: de, es, fr

# sidebarTransparencyDescription
source: Make sidebar background semi-transparent
de: Transparenz-Level der Seitenleiste einstellen
es: Hacer el fondo de la barra lateral semi-transparente
fr: Règle la transparence de la barre latérale

source: Theme
de: Thema
es: Tema
fr: Thème

source: Current Theme
de: Aktuelles Thema
es: Tema actual
fr: Thème actuel

# currentThemeDescription
source: Your currently active theme
de: Das aktuell ausgewählte Thema
es: Tu tema activo actualmente
fr: Le thème actuellement sélectionné

source: Color Scheme:
de: Farbpalette
es: Esquema de color:
fr: Schéma de couleurs

source: Primary
de: Primär
es: Primario
fr: Primaire

source: Secondary
de: Sekundär
es: Secundario
fr: Secondaire

source: Surface
de: Hintergrund
es: Superficie
fr: Surface (couleur)

source: Theme Presets
de: Thema-Vorlagen
es: Preajustes de tema
fr: Préréglages de thème

# themePresetsDescription
source: Choose from pre-designed themes. System themes automatically adapt to your system settings.
de: Vordefinierte Thema-Presets auswählen
es: Elige entre temas predefinidos. Los temas del sistema se adaptan automáticamente.
fr: Choisissez un préréglage de couleur

source: System Themes
de: Systemthemen
es: Temas del sistema
fr: Thèmes système

source: Light Themes
de: Helle Themen
es: Temas claros
fr: Thèmes clairs

source: Dark Themes
de: Dunkle Themen
es: Temas oscuros
fr: Thèmes sombres

source: Customize Colors
de: Farben anpassen
es: Personalizar colores
fr: Personnaliser les couleurs

# customizeColorsDescription
source: Personalize your theme colors
de: Eigene Farben für das Thema auswählen
es: Personaliza los colores del tema
fr: Choisissez vos couleurs personnalisées

source: Primary Color
de: Primärfarbe
es: Color primario
fr: Couleur primaire

source: Secondary Color
de: Sekundärfarbe
es: Color secundario
fr: Couleur secondaire

source: Surface Color
de: Oberflächenfarbe
es: Color de superficie
fr: Couleur de surface

source: Typography
de: Typografie
es: Tipografía
fr: Typographie

# typographyDescription
source: Customize fonts and text appearance
de: Schriftarten und Größen konfigurieren
es: Personaliza fuentes y apariencia del texto
fr: Choisissez la famille et la taille de police

source: Window Controls
de: Fenstersteuerung
es: Controles de ventana
fr: Contrôles de la fenêtre

source: Show Window Controls
de: Fenstersteuerung anzeigen
es: Mostrar controles de ventana
fr: Afficher les contrôles de la fenêtre

# showWindowControlsDescription
source: Display minimize, maximize, and close buttons
de: Zeigt die Minimise/Maximise/Close-Buttons
es: Mostrar botones minimizar, maximizar y cerrar
fr: Afficher les boutons de contrôle de la fenêtre

source: Controls Placement
de: Position der Fenstersteuerung
es: Ubicación de controles
fr: Placement des contrôles

# controlsPlacementDescription
source: Position of window control buttons
de: Bestimmt die Reihenfolge der Steuerungsbuttons
es: Posición de los botones de control de ventana
fr: Position des boutons de contrôle

source: Controls Order
de: Steuerungsreihenfolge
es: Orden de controles
fr: Ordre des contrôles

# controlsOrderDescription
source: Order of window control buttons
de: Anordnung der Fenstersteuerungsbuttons
es: Orden de los botones de control de ventana
fr: Ordre des boutons de contrôle

source: Auto
de: Automatisch
es: Automático
fr: Automatique

source: Left
de: Links
es: Izquierda
fr: Gauche

source: Right
de: Rechts
es: Derecha
fr: Droite

source: Minimize, Maximize, Close
de: Minimieren/Maximieren/Schließen
es: Minimizar, Maximizar, Cerrar
fr: Minimiser, Maximiser, Fermer

source: Close, Minimize, Maximize
de: Schließen/Minimieren/Maximieren
es: Cerrar, Minimizar, Maximizar
fr: Fermer, Minimiser, Maximiser

source: Close, Maximize, Minimize
de: Schließen/Maximieren/Minimieren
es: Cerrar, Maximizar, Minimizar
fr: Fermer, Maximiser, Minimiser

source: Close Button Positions
de: Positionen der Schließen-Buttons
es: Posiciones del botón de cierre
fr: Positions du bouton Fermer

# closeButtonPositionsDescription
source: Configure where close buttons appear in tabs and panels
de: Anpassung der Schließen-Button-Positionen
es: Configurar dónde aparecen los botones de cierre en pestañas y paneles
fr: Choisissez la position du bouton fermer

source: Quick Settings
de: Schnelleinstellungen
es: Ajustes Rápidos
fr: Paramètres rapides

# quickSettingsDescription
source: Set all close buttons at once
de: Schnellzugriff auf häufige Einstellungen
es: Establecer todas las posiciones de botones de cierre a la vez
fr: Accès rapide aux paramètres courants

# autoDescription
source: Follow platform default settings for the close button
de: Automatische Auswahl basierend auf System
es: Seguir la configuración predeterminada de la plataforma para el botón de cierre
fr: Détecte automatiquement la meilleure option

source: All Left
de: Alle links
es: Todo a la izquierda
fr: Tous à gauche

# allLeftDescription
source: Close buttons and window controls on left
de: Alle Steuerungen links anordnen
es: Botones de cierre y controles de ventana a la izquierda
fr: Tous les contrôles alignés à gauche

source: All Right
de: Alle rechts
es: Todo a la derecha
fr: Tous à droite

# allRightDescription
source: Close buttons and window controls on right
de: Alle Steuerungen rechts anordnen
es: Botones de cierre y controles de ventana a la derecha
fr: Tous les contrôles alignés à droite

source: Individual Settings
de: Individuelle Einstellungen
es: Ajustes individuales
fr: Paramètres individuels

# individualSettingsDescription
source: Fine-tune each close button position
de: Positionen individuell einstellen
es: Ajustar finamente la posición de cada botón de cierre
fr: Réglez chaque contrôle séparément

source: Tab Close Buttons
de: Tab-Schließen-Buttons
es: Botones de cierre en pestañas
fr: Boutons de fermeture d'onglet

# tabCloseButtonsDescription
source: Position of close buttons in tabs
de: Schließen-Button auf Tabs anzeigen
es: Posición de los botones de cierre en las pestañas
fr: Afficher les boutons de fermeture sur les onglets

source: Panel Close Buttons
de: Panel-Schließen-Buttons
es: Botones de cierre en paneles
fr: Boutons de fermeture du panneau

# panelCloseButtonsDescription
source: Position of close buttons in panels
de: Schließen-Button in Panels anzeigen
es: Posición de los botones de cierre en paneles
fr: Afficher les boutons de fermeture sur les panneaux

source: Currently
de: Derzeit
es: Actualmente
fr: Actuellement

# sidebarSearchPlaceholder
source: Search...
de: Dateien und Befehle durchsuchen...
es: Buscar...
fr: Rechercher dans la barre latérale...

# sidebarSearchOptions
source: Options
de: Suchoptionen für Seitenleiste
es: Opciones
fr: Options de recherche

# settingsAppearanceDetail
source: Appearance Settings
de: Anpassen von Thema und Farben
es: Configuración de apariencia
fr: Détails d'apparence

# settingsInterfaceDetail
source: Interface Settings
de: Anpassen von Layout und Verhalten
es: Configuración de interfaz
fr: Détails de l'interface

# topbarSearchDialogPlaceholder
source: Type to search...
de: Befehl oder Datei suchen...
es: Buscar (Ctrl+K)
fr: Rechercher dans la barre supérieure...

# showAppTitleSubtitle
source: Display application name in the top bar
de: Zeigt den Titel der Anwendung in der Titelleiste
es: Mostrar el título de la aplicación en la barra superior
fr: Afficher le titre de l'application dans la barre supérieure

# animationSpeedTestTitle
source: Animation Speed Test
de: Animationstest
es: Prueba de velocidad de animación
fr: Test de vitesse d'animation

source: Hover Me (Fast Animation)
de: Hover mich (schnell)
es: Pasa el cursor: animación rápida
fr: Survolez pour voir l'animation rapide

# fadeInNormalSpeed
source: Fade In Animation (Normal Speed)
de: Einblenden (normal)
es: Aparecer: velocidad normal
fr: Fondu (vitesse normale)

# gettingStartedTitle
source: Getting Started
de: Erste Schritte
es: Introducción
fr: Prise en main

# projectNotesTitle
source: Project Notes
de: Projektnotizen
es: Notas del proyecto
fr: Notes du projet

# searchOptionFilesTitle
source: Files
de: Dateien durchsuchen
es: Archivos
fr: Rechercher fichiers

# searchOptionFilesSubtitle
source: Search in file names
de: Suche nur Dateinamen
es: Buscar en nombres de archivos
fr: Inclure le contenu des fichiers dans la recherche

# searchOptionContentTitle
source: Content
de: Inhalt durchsuchen
es: Contenido
fr: Rechercher contenu

# searchOptionContentSubtitle
source: Search in file content
de: Suche im Dateiinhalt
es: Buscar en el contenido de archivos
fr: Rechercher le texte à l'intérieur des fichiers

# searchOptionSymbolsTitle
source: Symbols
de: Symbole durchsuchen
es: Símbolos
fr: Rechercher symboles

# searchOptionSymbolsSubtitle
source: Search for functions, classes
de: Suche nach Symbolnamen
es: Buscar funciones, clases
fr: Inclure les symboles dans la recherche

# moreMatches
source: +{count} more matches
de: Weitere Treffer {count}
es: +{count} coincidencias más
fr: Plus de correspondances {count}

source: No commands available
de: Keine Befehle verfügbar
es: No hay comandos disponibles
fr: Aucune commande disponible

# commandPaletteSearchFilesTitle
source: Search Files
de: Dateien suchen
es: Buscar archivos
fr: Recherche de fichiers dans la palette de commandes

# commandPaletteSearchFilesSubtitle
source: Search for files by name
de: Dateien in Projekt durchsuchen
es: Buscar archivos por nombre
fr: Rechercher des fichiers depuis la palette de commandes

# commandPaletteSearchInFilesTitle
source: Search in Files
de: In Dateien suchen
es: Buscar en archivos
fr: Recherche dans les fichiers

# commandPaletteSearchInFilesSubtitle
source: Search for text content in files
de: Suche innerhalb von Dateien
es: Buscar contenido de texto en archivos
fr: Rechercher dans le contenu des fichiers depuis la palette

# footerFilesCount
source: {count} files
de: {count} Dateien
es: {count} archivos
fr: {count} fichiers

source: Total
de: Gesamt
