Repository: zz0-0/loom
Catalog: loom/lib/l10n/app_*.arb
Languages: de, es, fr

# appTitle
source: Loom - Knowledge Base
de: Loom - Wissensdatenbank
es: Loom - Base de Conocimiento
fr: Loom - Base de Connaissances

source: General
de: Allgemein
es: Ajustes generales
fr: Général

# generalDescription
source: General preferences and application behavior
de: Allgemeine Einstellungen und Verhalten der Anwendung
es: Preferencias generales y comportamiento de la aplicación
fr: Préférences générales et comportement de l'application

source: Auto Save
de: Automatisches Speichern
es: Guardado Automático
fr: Sauvegarde Automatique

# autoSaveDescription
source: Automatically save changes at regular intervals
de: Änderungen automatisch in regelmäßigen Abständen speichern
es: Guardar cambios automáticamente en intervalos regulares
fr: Sauvegarder automatiquement les modifications à intervalles réguliers

source: Confirm on Exit
de: Beim Beenden bestätigen
es: Confirmar al Salir
fr: Confirmer en Quitant

# confirmOnExitDescription
source: Ask for confirmation when closing with unsaved changes
de: Bei Schließen mit ungespeicherten Änderungen nachfragen
es: Pedir confirmación al cerrar con cambios no guardados
fr: Demander confirmation lors de la fermeture avec des modifications non sauvegardées

source: Language
de: Sprache
es: Idioma
fr: Langue

# languageDescription
source: Application language
de: Sprache der Anwendung
es: Idioma de la aplicación
fr: Langue de l'application

source: Follow system language
de: Systemsprache verwenden
es: Seguir idioma del sistema
fr: Suivre la langue du système

source: Manual language selection
de: Sprache manuell wählen
es: Selección manual de idioma
fr: Sélection manuelle de la langue

source: English
de: Englisch
es: Inglés
fr: Anglais

# spanish
source: Español
de: Spanisch
fr: Espagnol

# french
source: Français
de: Französisch
es: Francés
fr: Langue française

# german
source: Deutsch
de: Deutsch (Sprache)
es: Alemán
fr: Allemand

source: Chinese
de: Chinesisch
es: Chino
fr: Chinois

source: Japanese
de: 日本語
es: Japonés
fr: Japonais

source: Korean
de: 한국어
es: Coreano
fr: Coréen

source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres

source: All settings
de: Alle Einstellungen
es: Todas las configuraciones
fr: Tous les paramètres

source: Appearance
de: Erscheinungsbild
es: Apariencia
fr: Apparence

# appearanceSubtitle
source: Theme, colors, layout
de: Thema, Farben, Layout
es: Tema, colores, diseño
fr: Thème, couleurs, mise en page

source: Interface
de: Oberfläche
es: Interfaz
fr: Interface utilisateur

# interfaceSubtitle
source: Window controls, layout
de: Anzeigen und Verhalten anpassen
es: Controles de ventana, diseño
fr: Contrôles de fenêtre, mise en page

# generalSubtitle
source: Preferences, behavior
de: Allgemeine Optionen
es: Preferencias, comportamiento
fr: Préférences, comportement

source: About
de: Über
es: Acerca de
fr: À propos

# aboutSubtitle
source: Version, licenses
de: Version, Lizenzen
es: Versión, licencias
fr: Version, licences

# aboutDescription
source: Information about Loom
de: Informationen über Loom
es: Información sobre Loom
fr: Informations sur la version et les licences de Loom.

source: Version
de: Version (aktuell)
es: Versión
fr: Version de l'application

source: Licenses
de: Lizenzen
es: Licencias
fr: Licences

source: View open source licenses
de: Open-Source-Lizenzen anzeigen
es: Ver licencias de código abierto
fr: Voir les licences open source

source: Loom
de: Loom App
es: Loom (aplicación)
fr: Loom — application

source: Build
de: Build-Nummer
es: Construir
fr: Numéro de build

# loomDescription
source: Loom is a modern code editor built with Flutter, designed for productivity and ease of use.
de: Loom ist ein moderner Editor, entwickelt mit Flutter, optimiert für Produktivität.
es: Loom es un editor de código moderno construido con Flutter, diseñado para productividad y facilidad de uso.
fr: Loom est une application de base de connaissances pour organiser et éditer des documents.

# loomDescriptionFull
source: Loom is a knowledge base application for organizing and editing documents.
de: Loom ist ein moderner, auf Flutter basierender Editor, der für Produktivität entwickelt wurde.
es: Loom es una aplicación de base de conocimiento para organizar y editar documentos.
fr: Loom est une application de base de connaissances pour organiser, rechercher et éditer vos documents efficacement.

source: Loom Documentation
de: Loom Dokumentation
es: Documentación de Loom
fr: Documentation Loom

source: Welcome to Loom!
de: Willkommen bei Loom
es: ¡Bienvenido a Loom!
fr: Bienvenue sur Loom !

source: Key Features:
de: Hauptfunktionen
es: Características Principales:
fr: Fonctionnalités clés :

# fileExplorerFeature
source: • File Explorer: Browse and manage your files
de: • Datei-Explorer: Ihre Dateien durchsuchen und verwalten
es: • Explorador de Archivos: Navegar y gestionar sus archivos
fr: • Explorateur de fichiers : parcourir et gérer vos fichiers

# richTextEditorFeature
source: • Rich Text Editor: Edit documents with syntax highlighting
de: Reicher Texteditor
es: • Editor de Texto Enriquecido: Editar documentos con resaltado de sintaxis
fr: • Éditeur riche : éditer des documents avec coloration syntaxique

# searchFeature
source: • Search: Find files and content quickly
de: Leistungsstarke Suche
es: • Búsqueda: Encontrar archivos y contenido rápidamente
fr: Recherche

# settingsFeature
source: • Settings: Customize your experience
de: Umfangreiche Einstellungen
es: • Configuraciones: Personalice su experiencia
fr: • Paramètres : personnaliser votre expérience

source: Keyboard Shortcuts:
de: Tastenkürzel
es: Atajos de Teclado:
fr: Raccourcis clavier :

# saveShortcut
source: • Ctrl+S: Save file
de: Speichern: ⌘S
es: • Ctrl+S: Guardar archivo
fr: • Ctrl+S : Sauvegarder le fichier

# globalSearchShortcut
source: • Ctrl+Shift+F: Global search
de: Globale Suche: ⌘P
es: • Ctrl+Mayús+F: Búsqueda global
fr: • Ctrl+Maj+F : Recherche globale

# undoShortcut
source: • Ctrl+Z: Undo
de: Rückgängig: ⌘Z
es: • Ctrl+Z: Deshacer
fr: • Ctrl+Z : Annuler

# redoShortcut
source: • Ctrl+Y: Redo
de: Wiederholen: ⇧⌘Z
es: • Ctrl+Y: Rehacer
fr: • Ctrl+Y : Rétablir

source: Menu
de: Menü
es: Menú
fr: Menu principal

source: File
de: Datei
es: Archivo
fr: Fichier

source: New File
de: Neue Datei
es: Nuevo Archivo
fr: Nouveau fichier

source: Open Folder
de: Ordner öffnen
es: Abrir Carpeta
fr: Ouvrir un dossier

source: Save
de: Speichern
es: Guardar
fr: Enregistrer

source: Save As
de: Speichern unter
es: Guardar Como
fr: Enregistrer sous

source: Export
de: Exportieren
es: Exportar
fr: Exporter

source: Export File
de: Datei exportieren
es: Exportar Archivo
fr: Exporter le fichier

source: Enter export location
de: Export-Speicherort eingeben
es: Ingresar ubicación de exportación
fr: Saisir l'emplacement d'exportation

# formatHint
source: txt, md, html, etc.
de: Wählen Sie ein Exportformat
es: Formato opcional (por ejemplo: markdown, html, pdf)
fr: ex : txt, md, html

# fileExportedAs
source: File exported as "{filename}"
de: Datei exportiert als "{filename}"
es: Archivo exportado como "{filename}"
fr: Fichier exporté sous "{filename}"

# failedToExportFile
source: Failed to export file: {error}
de: Datei konnte nicht exportiert werden: {error}
es: Error al exportar archivo: {error}
fr: Échec de l'exportation : {error}

source: Enter save location
de: Speicherort eingeben
es: Ingresar ubicación de guardado
fr: Saisir l'emplacement d'enregistrement

# fileSavedAs
source: File saved as "{filename}"
de: Datei gespeichert als "{filename}"
es: Archivo guardado como "{filename}"
fr: Fichier enregistré sous "{filename}"

# failedToSaveFile
source: Failed to save file: {error}
de: Datei konnte nicht gespeichert werden: {error}
es: Error al guardar archivo: {error}
fr: Échec de l'enregistrement : {error}

source: Open in New Tab
de: In neuem Tab öffnen
es: Abrir en nueva pestaña
fr: Ouvrir dans un nouvel onglet

# openInNewTabLabel
source: Open in New Tab
de: In neuem Tab öffnen
es: Abrir en nueva pestaña
fr: Ouvrir dans un nouvel onglet

# openInNewTabAction
source: Open in New Tab
de: In neuem Tab öffnen
es: Abrir en nueva pestaña
fr: Ouvrir dans un nouvel onglet

source: Close
de: Schließen
es: Cerrar
fr: Fermer

# closeLabel
source: Close
de: Schließen
es: Cerrar
fr: Fermer

# closeOthersLabel
source: Close Others
de: Andere schließen
es: Cerrar otros
fr: Fermer les autres

# closeAllLabel
source: Close All
de: Alle schließen
es: Cerrar todo
fr: Fermer tout

source: Edit
de: Bearbeiten
es: Editar
fr: Éditer

source: Undo
de: Rückgängig
es: Deshacer
fr: Annuler

source: Redo
de: Wiederholen
es: Rehacer
fr: Rétablir

source: Cut
de: Ausschneiden
es: Cortar
fr: Couper

source: Copy
de: Kopieren
es: Copiar
fr: Copier

source: Paste
de: Einfügen
es: Pegar
fr: Coller

source: Rename
de: Umbenennen
es: Renombrar
fr: Renommer

source: Delete
de: Löschen
es: Eliminar
fr: Supprimer

source: Delete Item
de: Element löschen
es: Eliminar elemento
fr: Supprimer l'élément

# renameSuccess
source: Renamed to {name}
de: Umbenannt in {name}
es: Renombrado a {name}
fr: Renommé en {name}

# deleteSuccess
source: {itemType} deleted successfully
de: {itemType} erfolgreich gelöscht
es: {itemType} eliminado con éxito
fr: {itemType} supprimé avec succès

# newFolderPlaceholder
source: new-folder
de: Neuer Ordner
es: nueva-carpeta
fr: nouveau-dossier

source: Create
de: Erstellen
es: Crear
fr: Créer

source: Create Folder
de: Ordner erstellen
es: Crear carpeta
fr: Créer un dossier

source: Create New File
de: Neue Datei erstellen
es: Crear Nuevo Archivo
fr: Créer un nouveau fichier

source: Create New Folder
de: Neuer Ordner erstellen
es: Crear Nueva Carpeta
fr: Créer un nouveau dossier

# fileCreated
source: File "{filename}" created
de: Datei "{filename}" erstellt
es: Archivo "{filename}" creado
fr: Fichier "{filename}" créé

# failedToCreateFile
source: Failed to create file: {error}
de: Datei konnte nicht erstellt werden: {error}
es: Error al crear archivo: {error}
fr: Échec de la création du fichier : {error}

# failedToCreateFolder
source: Failed to create folder: {error}
de: Ordner konnte nicht erstellt werden: {error}
es: Error al crear carpeta: {error}
fr: Échec de la création du dossier : {error}

# failedToOpenFolder
source: Failed to open folder: {error}
de: Ordner konnte nicht geöffnet werden: {error}
es: Error al abrir la carpeta: {error}
fr: Échec de l'ouverture du dossier : {error}

# failedToDeleteItem
source: Failed to delete item: {error}
de: Löschen des Elements fehlgeschlagen: {error}
es: Error al eliminar el elemento: {error}
fr: Échec de la suppression : {error}

# failedToRenameItem
source: Failed to rename item: {error}
de: Umbenennen des Elements fehlgeschlagen: {error}
es: Error al renombrar el elemento: {error}
fr: Échec du renommage : {error}

# failedToCloneRepository
source: Failed to clone repository: {error}
de: Fehler beim Klonen des Repositories: {error}
es: Error al clonar el repositorio: {error}
fr: Échec du clonage du dépôt : {error}

source: Browse
de: Durchsuchen
es: Examinar
fr: Parcourir

source: Select Folder Location
de: Speicherort auswählen
es: Seleccionar ubicación de la carpeta
fr: Sélectionner l'emplacement du dossier

# enterPathPrompt
source: Enter the path to the folder you want to open:
de: Pfad eingeben:
es: Introduzca la ruta de la carpeta que desea abrir:
fr: Entrez le chemin du dossier à ouvrir :

source: Directory Path
de: Verzeichnispfad
es: Ruta del Directorio
fr: Chemin du dossier

# folderPathHint
source: Enter folder path (e.g., /workspaces/my-folder)
de: /home/user/ordner
es: Introduzca la ruta de la carpeta (p. ej., /workspaces/mi-carpeta)
fr: Entrez le chemin du dossier (ex. /workspaces/mon-dossier)

# folderCreatedSuccess
source: Folder "{folderName}" created successfully!
de: Ordner "{folderName}" erfolgreich erstellt!
es: Carpeta "{folderName}" creada con éxito!
fr: Dossier "{folderName}" créé avec succès !

# failedToSelectLocation
source: Failed to select location: {error}
de: Auswahl des Speicherorts fehlgeschlagen: {error}
es: Error al seleccionar la ubicación: {error}
fr: Erreur lors de la sélection : {error}

source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner

# selectPanelFromSidebar
source: Select a panel from the sidebar
de: Wählen Sie ein Panel aus der Seitenleiste
es: Seleccionar un panel desde la barra lateral
fr: Sélectionnez un panneau depuis la barre latérale

# selectSidebarItemFirst
source: Please select an item from the sidebar first
de: Wählen Sie zuerst ein Element in der Seitenleiste aus
es: Por favor seleccione un elemento de la barra lateral primero
fr: Veuillez d'abord sélectionner un élément dans la barre latérale

# searchFilesHint
source: Search files...
de: Dateinamen oder Inhalt eingeben
es: Buscar archivos...
fr: Rechercher des fichiers...

source: Search files and commands...
de: Dateien und Befehle durchsuchen...
es: Buscar archivos y comandos...
fr: Rechercher fichiers et commandes

source: Search results will appear here
de: Suchergebnisse werden hier angezeigt
es: Los resultados de búsqueda aparecerán aquí
fr: Les résultats de recherche apparaîtront ici

source: No results found
de: Keine Ergebnisse gefunden
es: No se encontraron resultados
fr: Aucun résultat trouvé

source: Search your knowledge base...
de: Durchsuche deine Wissensdatenbank
es: Buscar en su base de conocimiento...
fr: Recherchez dans votre base de connaissances

source: Search everything...
de: Alles durchsuchen
es: Buscar todo...
fr: Tout rechercher

# searchPanelPlaceholder
source: Search Panel (To be implemented)
de: Suchen...
es: Panel de Búsqueda (Por implementar)
fr: Rechercher...

# searchTooltip
source: Search
de: Suche
es: Buscar
fr: Recherche

source: Find
de: Suchen
es: Buscar
fr: Rechercher

# findAndReplace
source: Find & Replace
de: Suchen und ersetzen
es: Buscar y Reemplazar
fr: Rechercher et remplacer

# findLabel
source: Find
de: Suchen
es: Buscar
fr: Rechercher

source: Replace with
de: Ersetzen durch
es: Reemplazar con
fr: Remplacer par

source: Replace
de: Ersetzen
es: Reemplazar
fr: Remplacer

source: Replace All
de: Alle ersetzen
es: Reemplazar Todo
fr: Remplacer tout

source: Find Next
de: Weitersuchen
es: Buscar Siguiente
fr: Rechercher suivant

source: Go to Line
de: Gehe zu Zeile
es: Ir a Línea
fr: Aller à la ligne

# pleaseEnterLineNumber
source: Please enter a line number
de: Bitte Zeilennummer eingeben
es: Por favor ingrese un número de línea
fr: Veuillez saisir un numéro de ligne

source: Invalid line number
de: Ungültige Zeilennummer
es: Número de línea inválido
fr: Numéro de ligne invalide

# lineNumberMustBeGreaterThanZero
source: Line number must be greater than 0
de: Die Zeilennummer muss größer als 0 sein
es: El número de línea debe ser mayor que 0
fr: Le numéro de ligne doit être supérieur à 0

# lineNumberExceedsMaximum
source: Line number exceeds maximum ({maxLines})
de: Zeilennummer überschreitet Maximum {maxLines}
es: El número de línea excede el máximo ({maxLines})
fr: Le numéro de ligne dépasse la limite ({maxLines})

# lineNumberLabel
source: Line number (1 - {maxLines})
de: Zeilennummer {maxLines}
es: Número de línea (1 - {maxLines})
fr: Numéro de ligne {maxLines}

source: Enter line number
de: Zeilennummer eingeben
es: Ingresar número de línea
fr: Entrez le numéro de ligne

# totalLines
source: Total lines: {count}
de: Gesamtzeilen: {count}
es: Total de líneas: {count}
fr: Total des lignes : {count}

source: Document title
de: Dokumenttitel
es: Título del documento
fr: Titre du document

source: Header text
de: Kopfzeilentext
es: Texto de encabezado
fr: En-tête

source: Preview
de: Vorschau
es: Vista previa
fr: Aperçu

# previewSampleText
source: Preview: The quick brown fox jumps over the lazy dog
de: Vorschau: Der schnelle braune Fuchs springt über den faulen Hund
es: Vista previa: El rápido zorro marrón salta sobre el perro perezoso
fr: Texte d'exemple

source: Exporting...
de: Exportiere...
es: Exportando...
fr: Export en cours...

source: Export Format
es: Formato de Exportación
fr: Format d'export

source: PDF
de: PDF-Dokument
es: Formato PDF
fr: PDF (format)

source: HTML
de: HTML-Dokument
es: Formato HTML
fr: HTML (format)

source: Markdown
de: Markdown-Dokument
es: Formato Markdown
fr: Markdown (format)

source: Plain Text
de: Klartext
es: Texto plano
fr: Texte brut

source: Plugin Manager
de: Plugin-Verwaltung
es: Administrador de Plugins
fr: Gestionnaire de plugins

source: Plugins
de: Erweiterungen
es: Extensiones
fr: Extensions

# noPluginsCurrentlyLoaded
source: No plugins are currently loaded
de: Derzeit keine Plugins geladen
es: No hay plugins cargados actualmente
fr: Aucun plugin chargé

source: Disable Plugin
de: Plugin deaktivieren
es: Desactivar Plugin
fr: Désactiver le plugin

source: Enable Plugin
de: Plugin aktivieren
es: Activar Plugin
fr: Activer le plugin

# failedToEnablePlugin
source: Failed to enable plugin: {error}
de: Plugin konnte nicht aktiviert werden: {error}
es: Error al activar plugin: {error}
fr: Échec de l'activation du plugin : {error}

# failedToDisablePlugin
source: Failed to disable plugin: {error}
de: Plugin konnte nicht deaktiviert werden: {error}
es: Error al desactivar plugin: {error}
fr: Échec de la désactivation du plugin : {error}

source: Installed
de: Installiert
es: Instalado
fr: Installé

source: Active
de: Aktiv
es: Activo
fr: Actif

source: Inactive
de: Inaktiv
es: Inactivo
fr: Inactif

# commandsCount
source: {count} commands
de: {count} Befehle
es: {count} comandos
fr: {count} commandes

source: Command executed successfully
de: Befehl erfolgreich ausgeführt
es: Comando ejecutado exitosamente
fr: Commande exécutée avec succès

# commandFailed
source: Command failed: {error}
de: Befehl fehlgeschlagen: {error}
es: Comando fallido: {error}
fr: Échec de la commande : {error}

# failedToExecuteCommand
source: Failed to execute command: {error}
de: Befehl konnte nicht ausgeführt werden: {error}
es: Error al ejecutar comando: {error}
fr: Échec de l'exécution : {error}

# commandKeyShortcut
source: ⌘K
de: Befehl: ⌘K
es: Atajo: ⌘K
fr: Raccourci : ⌘K

# minimizeTooltip
source: Minimize
de: Minimieren
es: Minimizar
fr: Minimiser

# maximizeTooltip
source: Maximize
de: Maximieren
es: Maximizar
fr: Maximiser

# closeTooltip
source: Close
de: Schließen
es: Cerrar
fr: Fermer

# zoomTooltip
source: Zoom
de: Zoomen
es: Ampliar/Reducir
fr: Contrôler le zoom

# toggleLineNumbersTooltip
source: Toggle line numbers
de: Zeilennummern umschalten
es: Alternar números de línea
fr: Basculer les numéros de ligne

# toggleMinimapTooltip
source: Toggle minimap
de: Miniaturansicht umschalten
es: Alternar minimapa
fr: Basculer le minimap

# undoTooltip
source: Undo (Ctrl+Z)
de: Rückgängig
es: Deshacer (Ctrl+Z)
fr: Annuler (Ctrl+Z)

# redoTooltip
source: Redo (Ctrl+Y)
de: Wiederholen
es: Rehacer (Ctrl+Y)
fr: Rétablir (Ctrl+Y)

# cutTooltip
source: Cut (Ctrl+X)
de: Ausschneiden
es: Cortar (Ctrl+X)
fr: Couper (Ctrl+X)

# copyTooltip
source: Copy (Ctrl+C)
de: Kopieren
es: Copiar (Ctrl+C)
fr: Copier (Ctrl+C)

# pasteTooltip
source: Paste (Ctrl+V)
de: Einfügen
es: Pegar (Ctrl+V)
fr: Coller (Ctrl+V)

# foldAllTooltip
source: Fold All (Ctrl+Shift+[)
de: Alle falten
es: Plegar todo (Ctrl+Shift+[)
fr: Réduire tout (Ctrl+Maj+[)

# unfoldAllTooltip
source: Unfold All (Ctrl+Shift+])
de: Alle entfalten
es: Desplegar todo (Ctrl+Shift+])
fr: Développer tout (Ctrl+Maj+])

# exportTooltip
source: Export (Ctrl+E)
de: Exportieren
es: Exportar (Ctrl+E)
fr: Exporter (Ctrl+E)

# newFileTooltip
source: New File
de: Neue Datei erstellen
es: Nuevo archivo
fr: Nouveau fichier

# newFolderTooltip
source: New Folder
de: Neuen Ordner erstellen
es: Nueva carpeta
fr: Nouveau dossier

# refreshTooltip
source: Refresh
de: Aktualisieren
es: Actualizar
fr: Actualiser

# fileSystemTooltip
source: File System
de: Dateisystem
es: Sistema de archivos
fr: Système de fichiers

# collectionsTooltip
source: Collections
de: Sammlungen
es: Colecciones
fr: Gérer les collections

# removeFromCollectionTooltip
source: Remove from collection
de: Aus Sammlung entfernen
es: Quitar de la colección
fr: Retirer de la collection

source: Nothing to undo
de: Nichts zum Rückgängig machen
es: Nada para deshacer
fr: Rien à annuler

source: Nothing to redo
de: Nichts zum Wiederherstellen
es: Nada para rehacer
fr: Rien à rétablir

source: Content cut to clipboard
de: Inhalt ausgeschnitten und in Zwischenablage kopiert
es: Contenido cortado al portapapeles
fr: Contenu coupé dans le presse-papiers

source: Content copied to clipboard
de: Inhalt in Zwischenablage kopiert
es: Contenido copiado al portapapeles
fr: Contenu copié dans le presse-papiers

source: Content pasted from clipboard
de: Inhalt aus Zwischenablage eingefügt
es: Contenido pegado desde el portapapeles
fr: Contenu collé depuis le presse-papiers

# noTextInClipboard
source: No text in clipboard to paste
de: Keine Textdaten in der Zwischenablage
es: No hay texto en el portapapeles para pegar
fr: Aucun texte dans le presse-papiers

source: No content to copy
de: Kein Inhalt zum Kopieren
es: No hay contenido para copiar
fr: Aucun contenu à copier

source: No content to cut
de: Kein Inhalt zum Ausschneiden
es: No hay contenido para cortar
fr: Aucun contenu à couper

source: No content to preview
de: Kein Inhalt zur Vorschau
es: No hay contenido para previsualizar
fr: Aucun contenu à prévisualiser

# fileSaved
source: File "{filename}" saved
de: Datei "{filename}" gespeichert
es: Archivo "{filename}" guardado
fr: Fichier "{filename}" enregistré

source: File saved successfully
de: Datei erfolgreich gespeichert
es: Archivo guardado exitosamente
fr: Fichier enregistré avec succès

# openFolderFirst
source: Please open a folder first to create a new file
de: Öffnen Sie zuerst einen Ordner
es: Por favor abra una carpeta primero para crear un nuevo archivo
fr: Ouvrez d'abord un dossier

# noFileOpenToSave
source: No file is currently open to save
de: Keine Datei geöffnet zum Speichern
es: No hay archivo abierto actualmente para guardar
fr: Aucun fichier ouvert à enregistrer

source: Export Document
de: Dokument exportieren
es: Exportar Documento
fr: Exporter le document

source: Include line numbers
de: Zeilennummern einbeziehen
es: Incluir números de línea
fr: Inclure les numéros de ligne

source: Include syntax highlighting
de: Syntaxhervorhebung einschließen
es: Incluir resaltado de sintaxis
fr: Inclure la coloration syntaxique

source: Include header
de: Kopfzeile einschließen
es: Incluir encabezado
fr: Inclure l'en-tête

source: Save Location
de: Speicherort
es: Ubicación de Guardado
fr: Emplacement d'enregistrement

source: Choose...
de: Auswählen...
es: Elegir...
fr: Choisir

# chooseTemplateOptional
source: Choose a template (optional)
de: Vorlage auswählen (optional)
es: Elegir una plantilla (opcional)
fr: Choisir un modèle (optionnel)

source: Empty
de: Leer
es: Vacío
fr: Vide

source: No Collections
de: Keine Sammlungen
es: Sin Colecciones
fr: Aucune collection

# createCollectionsToOrganize
source: Create collections to organize your files
de: Erstellen Sie Sammlungen, um Ihre Dateien zu organisieren
es: Crear colecciones para organizar sus archivos
fr: Créez des collections pour organiser vos fichiers

source: Create Collection
de: Sammlung erstellen
es: Crear Colección
fr: Créer une collection

source: Collection name
de: Sammlungsname
es: Nombre de colección
fr: Nom de la collection

source: My Collection
de: Meine Sammlung
es: Mi Colección
fr: Ma collection

source: Save Export
de: Export speichern
es: Guardar Exportación
fr: Enregistrer l'export

source: Repository URL
es: URL del repositorio
fr: URL du dépôt
