Repository: zz0-0/loom
Catalog: loom/lib/l10n/app_*.arb
Languages: de, es, fr

# enterGitRepositoryUrl
source: Enter Git repository URL (e.g., https://github.com/user/repo.git)
de: Git-Repository-URL eingeben
es: Ingrese la URL del repositorio Git (p. ej., https://github.com/usuario/repositorio.git)
fr: Entrez l'URL du dépôt Git

source: Clone from Git
de: Von Git klonen
es: Clonar desde Git
fr: Cloner depuis Git

source: Cloning repository...
de: Repository wird geklont...
es: Clonando repositorio...
fr: Clonage du dépôt...

# successfullyClonedRepository
source: Successfully cloned repository to: {path}
de: Repository erfolgreich geklont {path}
es: Repositorio clonado correctamente en: {path}
fr: Dépôt cloné avec succès {path}

# openFolderTitle
source: Open Folder
de: Arbeitsbereich öffnen
es: Abrir carpeta
fr: Ouvrir un dossier

source: Open an existing workspace
de: Einen bestehenden Arbeitsbereich öffnen
es: Abrir un espacio de trabajo existente
fr: Ouvrir un espace de travail existant

# openFolderMenu
source: Open Folder
de: Ordner-Menü öffnen
es: Abrir carpeta
fr: Ouvrir le dossier

source: Close Folder
de: Ordner schließen
es: Cerrar carpeta
fr: Fermer le dossier

source: Create a new document
de: Neues Dokument erstellen
es: Crear un nuevo documento
fr: Créer un nouveau document

# newFileTitle
source: New File
de: Neue Datei erstellen
es: Nuevo archivo
fr: Nouveau fichier

source: New Folder
de: Neuer Ordner
es: Nueva Carpeta
fr: Nouveau dossier

# noMatchesFound
source: No matches found for "{searchText}"
de: Keine Treffer gefunden {searchText}
es: No se encontraron coincidencias para "{searchText}"
fr: Aucun résultat trouvé {searchText}

source: Welcome to your knowledge base
de: Willkommen in Ihrer Wissensdatenbank
es: Bienvenido a su base de conocimiento
fr: Bienvenue dans votre base de connaissances

# loomAppTitle
source: Loom
de: Loom – Wissensdatenbank
es: Loom — Base de conocimiento
fr: Loom — Base de connaissances

source: Loom Knowledge Base
de: Loom Wissensdatenbank
es: Base de conocimiento de Loom
fr: Base de connaissances Loom

source: Your workspace
de: Ihr Arbeitsbereich
es: Su espacio de trabajo
fr: Votre espace de travail

source: Recent Files
de: Zuletzt geöffnet
es: Archivos recientes
fr: Fichiers récents

source: Favorites
de: Favoriten
es: Favoritos
fr: Favoris

source: History
de: Verlauf
es: Historial
fr: Historique

# helpAndSupport
source: Help & Support
de: Hilfe & Support
es: Ayuda y soporte
fr: Aide et support

source: Dark Mode
de: Dunkelmodus
es: Modo oscuro
fr: Mode sombre

source: Documents
de: Dokumente
es: Documentos
fr: Documents (vos fichiers)

source: Editor
de: Text-Editor
es: Editor de texto
fr: Éditeur

source: Collections
de: Sammlungen
es: Colecciones
fr: Collections (groupes)

# welcomeToLoomTitle
source: Welcome to Loom
de: Willkommen bei Loom
es: Bienvenido a Loom
fr: Bienvenue sur Loom

source: Your next-generation knowledge base
de: Ihre nächste Generation Wissensdatenbank
es: Su base de conocimiento de nueva generación
fr: Votre prochaine génération de base de connaissances

# fileLabel
source: File: {fileName}
de: Datei: {fileName}
es: Archivo: {fileName}
fr: Fichier: {fileName}

source: Options
de: Optionen
es: Opciones
fr: Paramètres

# applicationTitleLabel
source: Application Title
de: Anwendungstitel
es: Título de la aplicación
fr: Titre de l'application

# applicationTitleHint
source: Enter custom app title
de: Geben Sie den Titel der Anwendung ein
es: Ingrese un título para la aplicación
fr: Titre affiché dans la barre d'application

source: Show App Title
de: Anwendungstitel anzeigen
es: Mostrar título de la aplicación
fr: Afficher le titre de l'application

# showSearchBarTitle
source: Show Search Bar
de: Suchleiste anzeigen
es: Mostrar barra de búsqueda
fr: Afficher la barre de recherche

# showSearchBarSubtitle
source: Display search functionality in top bar
de: Zeigt die globale Suchleiste oben an
es: Mostrar la barra de búsqueda en la parte superior
fr: Afficher la barre de recherche dans la barre supérieure

source: Animation Speed
de: Animationsgeschwindigkeit
es: Velocidad de animación
fr: Vitesse de l'animation

source: Slow
de: Langsam
es: Lento
fr: Lent

source: Normal
de: Normal (Standard)
es: Predeterminado
fr: Normal (défaut)

source: Fast
de: Schnell
es: Rápido
fr: Rapide

source: Disabled
de: Deaktiviert
es: Desactivado
fr: Désactivé

source: Sidebar Transparency
de: Seitenleisten-Transparenz
es: Transparencia de la barra lateral
fr: Transparence de la barre latérale

# interfaceDescription
source: Configure window controls and layout options
de: Einstellungen für das Interface
es: Configurar controles de ventana y opciones de diseño
fr: Configurer les contrôles de fenêtre et les options de mise en page

source: UI Polish Showcase
de: UI-Polish Demo
es: Demostración de Pulido UI
fr: Démonstration d'amélioration de l'interface

source: Enhanced UI Animations
de: Erweiterte UI-Animationen
es: Animaciones UI Mejoradas
fr: Animations UI améliorées

source: Loading Indicators
de: Lade-Anzeigen
es: Indicadores de Carga
fr: Indicateurs de chargement

source: Smooth Loading
de: Sanftes Laden
es: Carga Suave
fr: Chargement fluide

source: Skeleton Loader
de: Platzhalter-Lader
es: Cargador Esquelético
fr: Chargeur squelette

source: Interactive Elements
de: Interaktive Elemente
es: Elementos Interactivos
fr: Éléments interactifs

source: Hover Animation
es: Animación al Pasar
fr: Animation au survol

source: Press Animation
de: Drück-Animation
es: Animación al Presionar
fr: Animation à la pression

source: Pulse Animation
de: Puls-Animation
es: Animación de Pulso
fr: Animation pulsée

source: Shimmer Effects
de: Schimmer-Effekte
es: Efectos de Brillo
fr: Effets de scintillement

source: Success Animations
de: Erfolgs-Animationen
es: Animaciones de Éxito
fr: Animations de réussite

source: Task Completed!
de: Aufgabe abgeschlossen!
es: ¡Tarea Completada!
fr: Tâche terminée

source: Animation Combinations
de: Animationskombinationen
es: Combinaciones de Animación
fr: Combinaisons d'animations

source: Interactive Button
de: Interaktiver Button
es: Botón Interactivo
fr: Bouton interactif

source: Animated Card
de: Animierte Karte
es: Tarjeta Animada
fr: Carte animée

# animatedCardDescription
source: This card demonstrates fade-in and slide-in animations combined.
de: Diese Karte demonstriert Fade-in- und Slide-in-Animationen kombiniert.
es: Esta tarjeta demuestra animaciones de fade-in y slide-in combinadas.
fr: Exemple de carte avec animations

source: Auto-save Interval
de: Auto-Speicher-Intervall
es: Intervalo de Auto-guardado
fr: Intervalle d'auto-enregistrement

source: Last saved:
de: Zuletzt gespeichert:
es: Último guardado:
fr: Dernière sauvegarde : {time}

source: just now
de: gerade eben
es: ahora mismo
fr: À l'instant

# minutesAgo
source: {count}m ago
de: vor {count}m
es: hace {count} minutos
fr: il y a {count} minutes

# hoursAgo
source: {count}h ago
de: vor {count}h
es: hace {count} horas
fr: il y a {count} heures

# daysAgo
source: {count}d ago
de: vor {count} Tagen
es: hace {count} días
fr: il y a {count} jours

# copyright
source: © 2024 Loom Team
es: © 2024 Equipo de Loom
fr: © 2024 Équipe Loom

source: Open Source Licenses
de: Open-Source-Lizenzen
es: Licencias de Código Abierto
fr: Licences open source

# usesFollowingLibraries
source: Loom uses the following open source libraries:
de: Loom verwendet folgende Open-Source-Bibliotheken:
es: Loom utiliza las siguientes bibliotecas de código abierto:
fr: Utilise les bibliothèques suivantes :

# fullLicenseTexts
source: For full license texts, please visit the respective folder repositories on GitHub.
de: Vollständige Lizenztexte finden Sie in den jeweiligen Repository-Ordnern.
es: Para textos completos de licencias, visite los repositorios de carpetas respectivos en GitHub.
fr: Textes complets des licences

source: Enter Path
de: Pfad eingeben
es: Ingresar Ruta
fr: Saisir le chemin

# pathHint
source: /home/user/folder
de: /home/benutzer/ordner
es: /home/usuario/carpeta
fr: Chemin (ex. /workspaces/mon-dossier)

source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler

source: Go
de: Los
es: Ir
fr: Aller

source: Apply
de: Anwenden
es: Aplicar
fr: Appliquer

# selectColorLabel
source: Select {label} Color
de: {label}-Farbe wählen
es: Seleccionar color {label}
fr: Sélectionner une couleur {label}

# fontFamilyLabel
source: Font Family
de: Schriftart
es: Familia de fuentes
fr: Famille de polices

# fontSizeLabel
source: Font Size
de: Schriftgröße
es: Tamaño de fuente
fr: Taille de la police

source: Exit
de: Beenden
es: Salir
fr: Quitter

source: View
de: Ansicht
es: Ver
fr: Affichage

source: Toggle Sidebar
de: Seitenleiste umschalten
es: Alternar Barra Lateral
fr: Basculer la barre latérale

source: Toggle Panel
de: Panel umschalten
es: Alternar Panel
fr: Basculer le panneau

source: Full Screen
de: Vollbild
es: Pantalla Completa
fr: Plein écran

source: Help
de: Hilfe
es: Ayuda
fr: Aide

source: Documentation
de: Dokumentation
es: Documentación
fr: Documentation du projet

source: No plugins loaded
de: Keine Plugins geladen
es: No hay plugins cargados
fr: Aucun plugin chargé

source: No content to export
de: Kein Inhalt zum Exportieren
es: No hay contenido para exportar
fr: Aucun contenu à exporter

source: Exit Application
de: Anwendung beenden
es: Salir de la Aplicación
fr: Quitter l'application

# confirmExit
source: Are you sure you want to exit Loom?
de: Sind Sie sicher, dass Sie Loom beenden möchten?
es: ¿Está seguro de que desea salir de Loom?
fr: Confirmer la fermeture

# cancelButton
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler

# folderPathLabel
source: Folder Path
de: Ordnerpfad
es: Ruta de la carpeta
fr: Chemin du dossier

# enterFolderNameHint
source: Enter folder name
de: Ordnername eingeben
es: Introduzca el nombre de la carpeta
fr: Entrez le nom du dossier

# enterFileNameHint
source: Enter file name (e.g., main.dart)
de: Dateinamen eingeben
es: Enter file name (e.g., document.md)
fr: Entrez le nom du fichier (ex. main.dart)

# enterInitialFileContentHint
source: Enter initial file content...
de: (Optional) Anfangsinhalt für die Datei eingeben
es: Introduzca el contenido inicial del archivo...
fr: Entrez le contenu initial du fichier...

# enterNewNameHint
source: Enter new name
de: Neuen Namen eingeben
es: Introduzca el nuevo nombre
fr: Entrez le nouveau nom

source: Filter File Extensions
de: Dateitypen filtern
es: Filtrar extensiones de archivo
fr: Filtrer les extensions de fichier

source: Show Hidden Files
de: Versteckte Dateien anzeigen
es: Mostrar archivos ocultos
fr: Afficher les fichiers cachés

# commentBlockTitle
source: Comment Block
de: Kommentarblock
es: Bloque de comentario
fr: Bloc de commentaire

source: System Default
de: Systemstandard
es: Predeterminado del sistema
fr: Par défaut (système)

# systemDefaultSubtitle
source: Adapts to system theme
de: Folgen Sie den Systemeinstellungen
es: Se adapta al tema del sistema
fr: S'adapte au thème système

source: Default Light
de: Standard (Hell)
es: Predeterminado claro
fr: Clair par défaut

# defaultLightSubtitle
source: Light theme
de: Helles Thema
es: Tema claro
fr: Thème clair

source: Default Dark
de: Standard (Dunkel)
es: Predeterminado oscuro
fr: Sombre par défaut

# defaultDarkSubtitle
source: Dark theme
de: Dunkles Thema
es: Tema oscuro
fr: Thème sombre

# syntaxWarningsTooltip
source: {count} syntax warnings
de: {count} Syntax-Warnungen
es: {count} advertencias de sintaxis
fr: {count} avertissements de syntaxe

# moreActionsTooltip
source: More actions
de: Weitere Aktionen
es: Más acciones
fr: Plus d'actions

source: File name
de: Dateiname
es: Nombre de archivo
fr: Nom de fichier

# enterFileName
source: Enter file name (e.g., example.blox)
de: Dateiname eingeben (z.B. beispiel.blox)
es: Ingresar nombre de archivo (ej. ejemplo.blox)
fr: Entrez le nom du fichier

source: Invalid file name
de: Ungültiger Dateiname
es: Nombre de archivo inválido
fr: Nom de fichier invalide

source: Invalid characters in file name
de: Ungültige Zeichen im Dateinamen
es: Caracteres inválidos en nombre de archivo
fr: Caractères invalides dans le nom de fichier

# versionState
source: Version: {version} • State: {state}
de: {version} ({state})
es: Versión: {version} • Estado: {state}
fr: Version : {version} • État : {state}

# appearanceDescription
source: Customize the look and feel of the application
de: Erscheinungsbild-Einstellungen
es: Personaliza la apariencia y la sensación de la aplicación
fr: Apparence et paramètres visuels

source: Open Link
de: Link öffnen
es: Abrir Enlace
fr: Ouvrir le lien

# openLinkConfirmation
source: Open this link in your browser? {url}
de: Möchten Sie diesen Link öffnen? {url}
es: ¿Abrir este enlace en su navegador? {url}
fr: Voulez-vous ouvrir ce lien ? {url}

# urlCopiedToClipboard
source: URL copied to clipboard: {url}
de: URL in die Zwischenablage kopiert {url}
es: URL copiada al portapapeles: {url}
fr: URL copiée dans le presse-papiers {url}

source: Copy URL
de: URL kopieren
es: Copiar URL
fr: Copier l'URL

# footnote
source: Footnote {id}
de: Fußnote {id}
es: Nota al pie {id}
fr: Note de bas de page {id}

# imageAlt
source: Image: {src}
de: Bildbeschreibung {src}
es: Imagen: {src}
fr: Image (source : {src})

source: Hide Replace
de: Ersetzen ausblenden
es: Ocultar Reemplazar
fr: Masquer Remplacer

source: Show Replace
de: Ersetzen anzeigen
es: Mostrar Reemplazar
fr: Afficher Remplacer

source: Match case
de: Groß-/Kleinschreibung beachten
es: Coincidir mayúsculas
fr: Respecter la casse

source: Use regex
de: Regex verwenden
es: Usar regex
fr: Utiliser une expression régulière

source: Share
de: Teilen
es: Compartir
fr: Partager

source: New Document
de: Neues Dokument
es: Nuevo Documento
fr: Nouveau document

source: Scan Document
de: Dokument scannen
es: Escanear Documento
fr: Analyser le document

source: No active plugins
de: Keine aktiven Plugins
es: No hay plugins activos
fr: Aucun plugin actif

source: Collections view for mobile
de: Sammlungsansicht für Mobilgeräte
es: Vista de colecciones para móvil
fr: Vue collections pour mobile

source: Mobile search interface
de: Mobile Suche
es: Interfaz de búsqueda móvil
fr: Interface de recherche mobile

# deleteCollection
source: Delete "{collectionName}"
de: "{collectionName}" löschen
es: Eliminar "{collectionName}"
fr: Supprimer la collection {collectionName}

# deleteCollectionConfirmation
source: Are you sure you want to delete this collection? This will not delete the actual files.
de: Sind Sie sicher, dass Sie diese Sammlung löschen möchten? Dies löscht nicht die eigentlichen Dateien.
es: ¿Está seguro de que desea eliminar esta colección? Esto no eliminará los archivos reales.
fr: Supprimer cette collection ? Cela n'effacera pas les fichiers.

source: Smart Suggestion
de: Intelligente Vorschläge
es: Sugerencia Inteligente
fr: Suggestion intelligente

source: Keep Here
de: Hier aufbewahren
es: Mantener Aquí
fr: Garder ici

source: Invalid folder name
de: Ungültiger Ordnername
es: Nombre de carpeta inválido
fr: Nom de dossier invalide

source: Invalid characters in folder name
de: Ungültige Zeichen im Ordnernamen
es: Caracteres inválidos en nombre de carpeta
fr: Caractères invalides dans le nom du dossier

# folderCreated
source: Folder "{folderName}" created
de: Ordner erstellt {folderName}
es: Carpeta "{folderName}" creada
fr: Dossier créé {folderName}

# useFileOpenToOpenFolder
source: Use File > Open to open a folder
de: Verwenden Sie Datei > Öffnen, um einen Ordner zu öffnen
es: Use Archivo > Abrir para abrir una carpeta
fr: Utilisez Fichier > Ouvrir pour ouvrir un dossier

# useWelcomeScreenToCreateFile
source: Use the welcome screen to create a new file
de: Verwenden Sie den Begrüßungsbildschirm, um eine Datei zu erstellen
es: Use la pantalla de bienvenida para crear un nuevo archivo
fr: Utilisez l'écran de bienvenue pour créer un fichier

source: Settings panel coming soon
de: Einstellungs-Panel bald verfügbar
es: Panel de configuraciones próximamente
fr: Panneau Paramètres bientôt disponible

# openedFile
source: Opened: {fileName}
de: Geöffnete Datei {fileName}
es: Abierto: {fileName}
fr: Fichier ouvert {fileName}

source: Include hidden files
de: Versteckte Dateien einbeziehen
es: Incluir archivos ocultos
fr: Inclure les fichiers cachés

# errorSavingFile
source: Error saving file: {error}
de: Fehler beim Speichern der Datei: {error}
es: Error al guardar archivo: {error}
fr: Erreur lors de l'enregistrement : {error}

source: Syntax Warnings
de: Syntax-Warnungen
es: Advertencias de Sintaxis
fr: Avertissements de syntaxe

# replacedOccurrences
source: Replaced {count} occurrences
de: Ersetzte Vorkommen: {count}
es: {count} ocurrencias reemplazadas
fr: Remplacements effectués : {count}

# createdFolder
source: Created folder: {folderName}
de: Ordner erstellt: {folderName}
es: Carpeta creada: {folderName}
fr: Dossier créé : {folderName}

# pleaseOpenWorkspaceFirst
source: Please open a workspace first
de: Bitte öffnen Sie zuerst einen Arbeitsbereich
es: Por favor abra un espacio de trabajo primero
fr: Veuillez ouvrir un espace de travail d'abord

# createdAndOpenedFile
source: Created and opened: {fileName}
de: Erstellt und geöffnet: {fileName}
es: Creado y abierto: {fileName}
fr: Créé et ouvert : {fileName}

# sourceControlPanelPlaceholder
source: Source Control Panel (To be implemented)
de: Quellcodeverwaltung...
es: Panel de Control de Código Fuente (Por implementar)
fr: Panel de contrôle de source (à implémenter)

# debugPanelPlaceholder
source: Debug Panel (To be implemented)
de: Debug-Panel (Noch nicht implementiert)
es: Panel de Depuración (Por implementar)
fr: Panel de débogage (à implémenter)

# extensionsPanelPlaceholder
source: Extensions Panel (To be implemented)
de: Erweiterungen-Panel (Noch nicht implementiert)
es: Panel de Extensiones (Por implementar)
fr: Panel des extensions (à implémenter)

# settingsPanelPlaceholder
source: Settings Panel (To be implemented)
de: Einstellungen...
es: Panel de Configuraciones (Por implementar)
fr: Panneau Paramètres (à implémenter)

# settingsTooltip
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres

# explorerTooltip
source: Explorer
de: Datei-Explorer
es: Explorador
fr: Explorateur

# flutterLicense
source: Flutter - BSD License
de: Flutter Lizenz
es: Flutter - Licencia BSD
fr: Flutter - Licence BSD

# riverpodLicense
source: Riverpod - MIT License
de: Riverpod Lizenz
es: Riverpod - Licencia MIT
fr: Riverpod - Licence

# adaptiveThemeLicense
source: Adaptive Theme - MIT License
de: Adaptive Theme Lizenz
es: Adaptive Theme - Licencia MIT
fr: AdaptiveTheme - Licence

# filePickerLicense
source: File Picker - MIT License
de: File Picker Lizenz
es: File Picker - Licencia MIT
fr: FilePicker - Licence

# sharedPreferencesLicense
source: Shared Preferences - BSD License
de: Shared Preferences Lizenz
es: Shared Preferences - Licencia BSD
fr: SharedPreferences - Licence

source: Search
de: Suche
es: Buscar
fr: Recherche

source: Development documentation
de: Entwicklungsdokumentation
es: Documentación de desarrollo
fr: Documentation de développement

# cloneRepositoryTitle
source: Clone Repository
de: Repository klonen
es: Clonar repositorio
fr: Cloner le dépôt

# openedWorkspace
source: Opened workspace: {workspaceName}
de: Geöffneter Arbeitsbereich {workspaceName}
es: Espacio de trabajo abierto: {workspaceName}
fr: Espace de travail ouvert {workspaceName}

source: Target Directory (optional)
de: Zielverzeichnis (optional)
es: Directorio destino (opcional)
fr: Répertoire cible (optionnel)

source: Leave empty to use repository name
de: Leer lassen, um den Repository-Namen zu verwenden
es: Deje en blanco para usar el nombre del repositorio
fr: Laisser vide pour utiliser le nom du dépôt

# editingFile
source: Editing: {filePath}
de: Datei bearbeiten {filePath}
es: Editando: {filePath}
fr: Édition du fichier {filePath}

# editorContentPlaceholder
source: Editor content will be implemented here. This is where your innovative knowledge base editing experience will live!
de: Beginnen Sie mit der Eingabe...
es: El contenido del editor se implementará aquí. Aquí es donde vivirá tu innovadora experiencia de edición de base de conocimientos!
fr: Contenu de l'éditeur...

source: Replacing...
de: Ersetze
es: Reemplazando...
fr: Remplacement...

source: Replacing All...
de: Ersetze alle
es: Reemplazando todo...
fr: Remplacement de tous

source: Search Error
de: Fehler bei der Suche
es: Error de búsqueda
fr: Erreur de recherche : {error}

source: Recent Searches
de: Letzte Suchanfragen
es: Búsquedas recientes
fr: Recherches récentes

source: Select Folder
de: Ordner auswählen
es: Seleccionar carpeta
fr: Sélectionner un dossier

source: Go up
de: Nach oben
es: Subir
fr: Remonter

source: Quick Access
de: Schnellzugriff
es: Acceso rápido
fr: Accès rapide

source: Home
de: Start
es: Inicio
fr: Accueil

source: Workspaces
de: Arbeitsbereiche
es: Espacios de trabajo
fr: Espaces de travail

source: Folders
de: Ordner
es: Carpetas
fr: Dossiers

source: No folders found
de: Keine Ordner gefunden
es: No se encontraron carpetas
fr: Aucun dossier trouvé

# searchResultsSummary
source: {matches} matches in {files} files ({time}ms)
de: {matches} Ergebnisse in {files} Dateien ({time}ms)
es: {matches} coincidencias en {files} archivos ({time}ms)
fr: {matches} correspondances dans {files} fichiers {time}

# matchesInFile
source: {count} matches
de: Treffer in Datei {count}
es: {count} coincidencias
fr: {count} correspondances dans ce fichier

# linePrefix
source: Line {number}
de: Zeile {number}
es: Línea {number}
fr: Ligne {number}

source: Type to search files and commands...
de: Tippe zum Durchsuchen von Dateien & Befehlen
es: Escribe para buscar archivos y comandos...
fr: Tapez pour rechercher fichiers et commandes

# navigateUpDown
source: ↑↓ Navigate
de: Nach oben/unten navigieren
es: ↑↓ Navegar
fr: Naviguer haut/bas

# selectEnter
source: ↵ Select
de: Wählen (Enter)
es: ↵ Seleccionar
fr: Sélectionner (Entrée)

# closeEscape
source: Esc Close
de: Schließen (Esc)
es: Esc Cerrar
fr: Fermer (Échap)

source: Find File
de: Datei finden
es: Buscar archivo
fr: Trouver un fichier

source: Type to search files...
de: Tippe zum Durchsuchen von Dateien
es: Escribe para buscar archivos...
fr: Tapez pour rechercher des fichiers

source: No files found in workspace
de: Keine Dateien im Arbeitsbereich gefunden
es: No se encontraron archivos en el espacio de trabajo
fr: Aucun fichier trouvé dans l'espace de travail

# noFilesMatchSearch
source: No files match your search
de: Keine Dateien passen zur Suche
es: Ningún archivo coincide con tu búsqueda
fr: Aucun fichier ne correspond à la recherche

# navigateOpenClose
source: ↑↓ Navigate • ↵ Open • Esc Close
de: Öffnen/Schließen
es: ↑↓ Navegar • ↵ Abrir • Esc Cerrar
fr: Ouvrir/Fermer

source: Switch Theme
de: Thema wechseln
es: Cambiar tema
fr: Changer le thème

# layoutAndVisual
source: Layout & Visual
de: Layout & Darstellung
es: Diseño y visual
fr: Disposition et visuel

source: Compact Mode
de: Kompaktmodus
es: Modo compacto
fr: Mode compact

# compactModeDescription
source: Use smaller UI elements and reduced spacing
de: Reduziert Abstände für kompaktere Ansicht
es: Usar elementos de UI más pequeños y un espaciado reducido
fr: Réduit les paddings pour une interface compacte

source: Show Icons in Menu
de: Symbole im Menü anzeigen
es: Mostrar iconos en el menú
fr: Afficher les icônes dans le menu

# showIconsInMenuDescription
source: Display icons next to menu items
de: Zeigt Symbole neben Menüeinträgen an
es: Mostrar iconos junto a los elementos del menú
fr: Afficher des icônes à côté des éléments de menu

# animationSpeedDescription
source: Speed of UI animations and transitions
de: Anpassen der Geschwindigkeit für UI-Animationen
es: Velocidad de las animaciones e transiciones de la interfaz
fr: Contrôle la vitesse des animations UI
